#include<stdio.h>
#define Pi 3.1415926535897932384626433832795028841971693993751058209749		//定义常量Pi（圆周率）
int main()
{
	double r, h, l, s1, s2, v1, v2;											//定义双精度浮点型局部变量
	printf("请分别输入圆半径与圆柱高：");										//打印输入说明
	scanf_s("%lf %lf", &r, &h);												//输入圆半径和圆柱高
	l = 2*Pi * r;															//计算圆周长
	s1 = Pi * r * r;														//计算圆面积
	s2 = 4 * s1;															//计算圆球表面积
	v1 = 0.75 * s1 * r;														//计算圆球体积
	v2 = s1 * h;															//计算圆柱体积
	printf("圆周长=\t\t%.2lf\n圆面积=\t\t%.2lf\n圆球表面积=\t%.2lf\n圆球体积=\t%.2lf\n圆柱体积=\t%.2lf\n",l,s1,s2,v1,v2);//输出结果
}