#include <stdio.h>
//对分查找（作业）
int main()
{
	printf("数据如下:\n");
	double arr[15] = { 100,90,80,70,60,50.2,50.1,50,49.9,49.8,\
							40,30,29,28,1 };					//初始化数组
	for (int i = 0; i < 15; i++){								//输出数组
		printf("%5.1lf", arr[i]);
	}
	while (1) {													//令循环条件始终为真，使用户可以多次查找
		double x;
		printf("\n请输入要查找的数: ");							//输出使用说明
		scanf_s("%lf", &x);										//输入要查找的数
		int i = 0, j = 14, m = 0;
		while (i <= j) {										//当待查找的范围大于等于0时，继续查找
			m = (i + j) / 2;									//计算中间元素的下标
			if (x < *(arr+m)) i = m + 1;						//让待查找元素与中间元素比较，若待查找元素小于中间元素，待查找范围的下界移动到中间元素的右边一位
			else if (x > *(arr+m)) j = m - 1;					//让待查找元素与中间元素比较，若待查找元素大于中间元素，待查找范围的上界移动到中间元素的左边一位
			else {
				printf("要查找的数在第%d位", m+1);				//若待查找元素等于中间元素，则输出中间元素的位置
				break;											//并跳出该循环
			}
		}
		if(i>j) printf("无此数");								//若最终待查找范围的下界越过了上界，说明查找失败
	}
	return 0;
}